#დავალება: 
# შექმენით პითონში ფუნქცია სახელად manual pop.
# მას გადაეცემა ორი არგუმენტი - სია და ინდექსი, რომელიც 
# გვინდა რომ სიიდან წავშალოთ. ინდექსის default მნიშვნელობა 
# უნდა იყოს -1. for ციკლით ახალ სიაში მხოლოდ ის ელემენტები 
# უნდა დავამატოთ, რომელიც არ უტოლდება ამ ინდექსს. 
# საბოლოოდ დავაბრუნოთ ეს სია


def manual_pop(list, index):
    new_list = []

    for i in list:
        if i != list[index]:
            new_list.append(i)
    return new_list
    print(new_list)

print(manual_pop([1,2,3,4,5,6], -1))

